[{"authors":[],"categories":[{"title":"Revanced","url":"/categories/revanced/"},{"title":"Apks","url":"/categories/apks/"}],"content":"Revanced Apks for Youtube, Reddit and X(Twitter) I have explained what Revanced apps are in this post. For better understanding first checkout that post.\nReddit Download link : github\nApk version: 2023.50.1\nRevanced features:\nDisable screenshot popup Hide ads Sanitize sharing links Unlock premium Reddit icons X(Twitter) Download link : github\nApk version: 10.20.0\nRevanced features:\nDynamic color Hide ads Hide recommended users Youtube Download link : github\nNotes: In order to sign in to your google account you must download Vanced MicroG. This an opensource apk alternative to google services. Download it from here or get your own version from a contributer\u0026rsquo;s github or make your own.\nApk version: 18.45.43\nRevanced features:\nAlternative thumbnails Always autorepeat Announcements Bypass URL redirects Client spoof Comments Copy video URL Custom player overlay opacity Disable shorts on startup Disable auto captions Disable fine scrubbing gesture Disable player popup panels Disable zoom haptics Enable debugging Enable tablet layout External downloads HDR auto brightness Hide \u0026lsquo;Load more\u0026rsquo; button Hide shorts components Hide ads Hide album cards Hide autoplay button Hide breaking news shelf Hide captions button Hide cast button Hide crowdfunding box Hide email address Hide endscreen cards Hide filter bar Hide floating microphone button Hide info cards Hide layout components Hide player buttons Hide seekbar Hide timestamp Hide video action buttons Minimized playback Navigation buttons Old video quality menu Open links externally Playback speed Player flyout menu Premium heading Remember video quality Return Youtube Dislike Seekbar tapping SponserBlock Spoof app version Spoof device demnsions Swipe controls Tablet mini player Theme Vanced MicroG support Video ads Wide searchbar It is highly advisable to create your own version of revanced apps and don\u0026rsquo;t trust sources of apks in the internet\n","date":"December 19, 2023","img":"","lang":"en","langName":"English","largeImg":"","permalink":"/posts/revancedfiles1/","series":[],"smallImg":"","tags":[{"title":"Revanced","url":"/tags/revanced/"},{"title":"Android","url":"/tags/android/"},{"title":"Youtube","url":"/tags/youtube/"},{"title":"Reddit","url":"/tags/reddit/"},{"title":"X(Twitter)","url":"/tags/xtwitter/"}],"timestamp":1702973981,"title":"Revanced Apks (Youtube, X(Twitter), Reddit) 19 December 2023"},{"authors":[],"categories":[{"title":"Windows","url":"/categories/windows/"},{"title":"Mac","url":"/categories/mac/"},{"title":"Problems","url":"/categories/problems/"},{"title":"Video Editors","url":"/categories/video-editors/"}],"content":"CF cards only working on MacOS If you\u0026rsquo;re a video editor working with footage from Alexa Minis or Alexa LFs, you have probably heard this sentence before. CF cards only work on Mac. This is simply not true and we\u0026rsquo;ll go through what is the problem here.\nConnection Ports These CF drives are extremely fast drives and therefore require require fast ports to be connected to. Arri suggest using Thunderbolt 3 at least for CFast 2.0 cards which are the newer ones typically by the AngelBird Company. But if your Cfast card reader has a normal USB instead of USB type C, you should use USB 3.2 Gen 2x2 or 2x1 (very confusing naming). So search for your laptop model or for your motherboard model on the web and see if it has those ports to get the most out of your Cfast. However if there is power being delivered to your CFast card reader then your usb generation should only affect your speed not it working or not. (except for Thunderbolt 2 and USB 2 ports which can\u0026rsquo;t deliver power to CFast 2.0 cards at all.)\nUDF formatting These CF cards or CFast cards are UDF formatted. These drives are well supported on Mac and were supported on Windows 10 and Windows 11 at one time. However an \u0026ldquo;update\u0026rdquo; for Windows apparently broke this feature on Windows and it\u0026rsquo;s being solved for the past 2 years.\nWhat can you do in this case? This is temporary solution and the main fix will come from Microsoft, but you should rollback your updates to a point which it was before this update from Microsoft. To this search for rolling back updates on the web or on your windows search and you\u0026rsquo;ll see what you should do. However rolling back updates means rolling back security updates as well, Which is not recommended. but if you have to you have to.\nThe advanced solution for Windows 10 What the update broke is a file called partmgr.sys located in C:/Windows/system32/drivers/:\nTake a backup of that file (add a .back to the end of the file name). Download this file and put it in the same directory. Replace the old version if it asks you to. Change the permission of the file to administrator from the properties. Reboot Note that every Windows Update breaks this function again and you should repeat the process\n","date":"October 31, 2023","img":"/posts/videoeditingproblem2/featured.jpg","lang":"en","langName":"English","largeImg":"/posts/videoeditingproblem2/featured_huf677ab5284dc3059c291ae31652dfe1d_132708_500x0_resize_q75_box.jpg","permalink":"/posts/videoeditingproblem2/","series":[],"smallImg":"/posts/videoeditingproblem2/featured_huf677ab5284dc3059c291ae31652dfe1d_132708_180x0_resize_q75_box.jpg","tags":[{"title":"Windows","url":"/tags/windows/"},{"title":"Mac","url":"/tags/mac/"},{"title":"Problems","url":"/tags/problems/"},{"title":"Video Editors","url":"/tags/video-editors/"}],"timestamp":1698779666,"title":"CFast Cards Not Working in Windows"},{"authors":[],"categories":[{"title":"Windows","url":"/categories/windows/"},{"title":"Mac","url":"/categories/mac/"},{"title":"Problems","url":"/categories/problems/"},{"title":"Video Editors","url":"/categories/video-editors/"}],"content":"External drives are not recogonized either on Windows or MacOS To better understand why this problem happens we must first understand some basic terms.\nFile systems: File systems are methods that data is stored and retrieved on operating systems. Now this is not a clear explanation if you\u0026rsquo;re not familiar with computing and not tech savvy in general. So let\u0026rsquo;s explain it better. Basically every operating system (Windows, MacOS, Linux, \u0026hellip;) chooses a variety of file systems to support. This means that each of these operating systems can write and read information in those file system types.\nWhere is the problem in this? The problem begins when one of these file systems are exclusive to one operating system and you format your hard drive to one of these proprietary ones, then it can not be read in other operating systems.\nDifferent file systems: There are many popular filesystems around including NTFS, FAT32, ExFat, Btrfs and many more. NTFS is a propriety file system developed by Microsoft and is exclusive for Windows. APFS is a propriety file system developed by Apple and is exclusive for MacOS. HFS and HFS+ are propriety file systems developed by Apple and are exclusive for MacOS. Above are the known propriety file systems that I know of but these are the most popular ones. There are some general file systems that almost all operating systems support. One of the most popular ones in this category is FAT32. Basically everything supports FAT32. But it has a file size limit of 4GBs , meaning you can\u0026rsquo;t store files larger than 4GB on drives that have this file system.\nWhat is the best format for compatibility You should always format your drives to exFAT. That\u0026rsquo;s it. It is supported in Windows, MacOS, and Linux. I have tested this myself. So if you\u0026rsquo;re a video editor use exFAT. So you can have cross platform compatibility.\nWhat if I can\u0026rsquo;t format my drive now and want access to my files on one of these operating systems? Say someone copied the footage to your drive and you want to copy the footage in your machine before formatting it. Let\u0026rsquo;s see the solution.\nWindows: If your operating system is Windows and your drive was working on a Mac but not showing up on your Windows machine. First check if this is actually a file system issue and not a drive problem. The drive should be powered on, and you should be able to unmount it from the taskbar. If you right click on the Windows start and check disk management, you should see that your external drive is recognized but the file system in not shown like your internal drive which is generally NTFS. So if it was like this it is probably in APFS or HFS and you need third party software to access it.\nParagon software company has some great products for this issue Download their software for this issue from their website:\nHFS for Windows\nAPFS for Windows\nDownload these programs and install them. You will see your drive recognized in one of them and mounted as a normal drive from now on. But remember to don\u0026rsquo;t rely heavily on these softwares and format your drive to exFAT after you\u0026rsquo;re done.\nMacOS: If your operating system is MacOS and your drive was working on a Windows PC but not showing up on your Mac. First check if this is actually a file system issue and not a drive problem. Do this by running the disk utility app and check if your drive is recognized. If it was and you know it was working on a Windows PC, the drive is probably in NTFS format and you\u0026rsquo;ll need a workaround to make it work.\nYou can use third party software for this for example from Paragon but I recommend that you do it from terminal yourself. This is a bit advanced but more reliable and free.\nOpen Terminal Type this command and press return and enter your password after that sudo nano /etc/fstab Replace \u0026ldquo;NAME\u0026rdquo; in this command with your drive name and press return If your drive contains spaces in it\u0026rsquo;s name you should enter them as \\040 LABEL=NAME none ntfs rw, auto, nobrowse Press Control + O then Control + X on Mac keyboard. In Finder, click Go then go to Folder then type: /Volumes, and click \u0026ldquo;Go\u0026rdquo;. You can now access your drive from here. ","date":"October 31, 2023","img":"/posts/videoeditingproblem/featured.jpg","lang":"en","langName":"English","largeImg":"/posts/videoeditingproblem/featured_hu5a1df5d6cca77f0876c4c8749db3d7d6_120162_500x0_resize_q75_box.jpg","permalink":"/posts/videoeditingproblem/","series":[],"smallImg":"/posts/videoeditingproblem/featured_hu5a1df5d6cca77f0876c4c8749db3d7d6_120162_180x0_resize_q75_box.jpg","tags":[{"title":"Windows","url":"/tags/windows/"},{"title":"Mac","url":"/tags/mac/"},{"title":"Video Editors","url":"/tags/video-editors/"},{"title":"Problems","url":"/tags/problems/"}],"timestamp":1698772749,"title":"Video Edtiors Problems With Footages on External Hard Drives"},{"authors":[],"categories":[{"title":"Revanced","url":"/categories/revanced/"},{"title":"Apks","url":"/categories/apks/"}],"content":"Revanced Version of Youtube Music I have explained what Revanced apps are in this post. For better understanding first checkout that post.\nMainly due to google killing google podcasts app, I\u0026rsquo;ll be switching to YouTube Music for podcast listening. Plus with revanced version of YT music, this is another platform for listening to songs for free. Note that like Youtube Revanced this supports VancedMicroG. I\u0026rsquo;ll link a trusted version of that as well.\nRevanced YouTube Music will be added to my version of released apks from now on\nIf you need any other apps in revanced form send me a request from the contact form\nDownload link : github\nVancedMicroG : github\nApk version : 6.23.54\nRevanced features:\nBackground play Bypass certificate checks Codecs unlock Exclusive audio playback Hide get premium Minimized playback music Music video ads Remove upgrade button Vanced MicroG support ","date":"October 24, 2023","img":"","lang":"en","langName":"English","largeImg":"","permalink":"/posts/revancedytmusic/","series":[],"smallImg":"","tags":[{"title":"Revanced","url":"/tags/revanced/"},{"title":"Android","url":"/tags/android/"},{"title":"Youtube","url":"/tags/youtube/"}],"timestamp":1698147325,"title":"Revanced Youtube Music, 24 October 2023"},{"authors":[],"categories":[],"content":"Getting Spotify premium features with help of xmanager What is the difference between Spotify premium and Spotify free? As with most streaming platforms you get more features when you purchase the premium version of the app. These features include an ad-free expreience, higher quality listening, selecting music, not shuffling , downloading the music for offline listening and more\u0026hellip;\nWhat do you get with X-manager version of Spotify? Xmanager is an app that let\u0026rsquo;s you download modded and patched Spotify apks. So with the Spotify apks that are downloaded with Xmanager: Well you certainly don\u0026rsquo;t get ads. You can choose your music as well. But no downloading or higher quality listening.\nIs this safe? Yes it\u0026rsquo;s perfectly fine. It\u0026rsquo;s open source on github. This is their website. Don\u0026rsquo;t trust me, go check it out yourself.\nEasier route In case you don\u0026rsquo;t want to downlaod Xmanager and then the spotify apk. Here\u0026rsquo;s their telegram. They provide pre-patched apks for every type of android device. If you want to install this next to the original Spotify app, install one of the cloned ones. They have proven to me that they\u0026rsquo;re safe to use. Of course you shouldn\u0026rsquo;t trust me or them and check the apk files with virustotal.\nHere\u0026rsquo;s how the patched app looks:\nWhere to download? Here\u0026rsquo;s the download link to the latest version of Xmanager from their github. You can directly check their github or their website and download from there.\nWhat next? From any of the above routes, either via the xmanager app or their telegram channel, the process is now simple. Install the Spotify apk for your cpu architecture. If you still have any questions, read their FAQ. Some versions can have notes to do after installing, some not. Be sure to check for that as well.\nEnjoy your ad-free experience now for free\n","date":"October 23, 2023","img":"","lang":"en","langName":"English","largeImg":"","permalink":"/posts/spotify/","series":[],"smallImg":"","tags":[{"title":"Spotify","url":"/tags/spotify/"},{"title":"Mod","url":"/tags/mod/"}],"timestamp":1698080310,"title":"Spotify Premium Features for Free With Xmanager"},{"authors":[],"categories":[{"title":"Revanced","url":"/categories/revanced/"},{"title":"Apks","url":"/categories/apks/"}],"content":"Revanced Apks for Youtube, Reddit and X(Twitter) I have explained what Revanced apps are in this post. For better understanding first checkout that post.\nReddit Download link : github\nApk version: 2023.41.1\nRevanced features:\nDisable screenshot popup Hide ads Sanitize sharing links Unlock premium Reddit icons X(Twitter) Download link : github\nApk version: 10.12.0\nRevanced features:\nDynamic color Hide ads Hide recommended users Youtube Download link : github\nNotes: In order to sign in to your google account you must download Vanced MicroG. This an opensource apk alternative to google services. Download it from here or get your own version from a contributer\u0026rsquo;s github or make your own.\nApk version: 18.38.44\nRevanced features:\nAlternative thumbnails Always autorepeat Announcements Bypass URL redirects Client spoof Comments Copy video URL Custom player overlay opacity Disable shorts on startup Disable auto captions Disable fine scrubbing gesture Disable player popup panels Disable zoom haptics Enable debugging Enable tablet layout External downloads HDR auto brightness Hide \u0026lsquo;Load more\u0026rsquo; button Hide shorts components Hide ads Hide album cards Hide autoplay button Hide breaking news shelf Hide captions button Hide cast button Hide crowdfunding box Hide email address Hide endscreen cards Hide filter bar Hide floating microphone button Hide info cards Hide layout components Hide player buttons Hide seekbar Hide timestamp Hide video action buttons Minimized playback Navigation buttons Old video quality menu Open links externally Playback speed Player flyout menu Premium heading Remember video quality Return Youtube Dislike Seekbar tapping SponserBlock Spoof app version Spoof device demnsions Swipe controls Tablet mini player Theme Vanced MicroG support Video ads Wide searchbar It is highly advisable to create your own version of revanced apps and don\u0026rsquo;t trust sources of apks in the internet\n","date":"October 21, 2023","img":"","lang":"en","langName":"English","largeImg":"","permalink":"/posts/revancedfiles/","series":[],"smallImg":"","tags":[{"title":"Revanced","url":"/tags/revanced/"},{"title":"Android","url":"/tags/android/"},{"title":"Youtube","url":"/tags/youtube/"},{"title":"Reddit","url":"/tags/reddit/"},{"title":"X(Twitter)","url":"/tags/xtwitter/"}],"timestamp":1697900110,"title":"Revanced Apks (Youtube, X(Twitter), Reddit) 21 October 2023"},{"authors":[],"categories":[{"title":"Revanced","url":"/categories/revanced/"}],"content":"Revanced Apps To be simple about it revanced apps are apps that have been modified in a way to add certain functionalities. For example, a revanced youtube, is a youtube app with most of the youtube premium features for free. Meaning no ads, content playing while not on the app, window in window playing and more features that the youtube premium offers. There are many apps that have revanced versions.\nWhich apps are supported? There are lots of apps that are supported. You can see a full list of them in revanced\u0026rsquo;s own website here .\nMy version of revanced apps The main point is that this patches must be made for your apps to work. Or the apks should be downloaded from somewhere. I\u0026rsquo;ll be providing apps that I use in the revanced form of them from now on on this website. and the files will be hosted on github.\nCan I patch the apps myself? Sure, you can but the simplest way is having a rooted device which I have. If you have a rooted device download revanced manager app from here , and from there the process is simple. Download the apk of the app you want to patch from apkmirror if you don\u0026rsquo;t have the suggested version of the app installed, select your patches and you\u0026rsquo;re done. If you have the suggested version just patch that and install it.\nHow revanced manager looks ","date":"October 19, 2023","img":"","lang":"en","langName":"English","largeImg":"","permalink":"/posts/revanced/","series":[],"smallImg":"","tags":[{"title":"Revanced","url":"/tags/revanced/"},{"title":"Android","url":"/tags/android/"}],"timestamp":1697705679,"title":"Revanced"},{"authors":[],"categories":[],"content":"Hi there, I\u0026rsquo;m Parsa. Everything that interests me in technology, I\u0026rsquo;ll post here.\n","date":"January 1, 1","img":"","lang":"en","langName":"English","largeImg":"","permalink":"/about/","series":[],"smallImg":"","tags":[],"timestamp":-62135596800,"title":"About"},{"authors":[],"categories":[],"content":"","date":"January 1, 1","img":"","lang":"en","langName":"English","largeImg":"","permalink":"/contact/","series":[],"smallImg":"","tags":[],"timestamp":-62135596800,"title":"Contact Us"},{"authors":[],"categories":[],"content":"","date":"January 1, 1","img":"","lang":"en","langName":"English","largeImg":"","permalink":"/offline/","series":[],"smallImg":"","tags":[],"timestamp":-62135596800,"title":"Offline"}]
