[{"authors":[],"categories":[{"title":"Revanced","url":"/categories/revanced/"}],"content":"Revanced Apps To be simple about it revanced apps are apps that have been modified in a way to add certain functionalities. For example, a revanced youtube, is a youtube app with most of the youtube premium features for free. Meaning no ads, content playing while not on the app, window in window playing and more features that the youtube premium offers. There are many apps that have revanced versions.\nWhich apps are supported? There are lots of apps that are supported. You can see a full list of them in revanced\u0026rsquo;s own website here .\nMy version of revanced apps The main point is that this patches must be made for your apps to work. Or the apks should be downloaded from somewhere. I\u0026rsquo;ll be providing apps that I use in the revanced form of them from now on on this website. and the files will be hosted on github.\nCan I patch the apps myself? Sure, you can but the simplest way is having a rooted device which I have. If you have a rooted device download revanced manager app from here , and from there the process is simple. Download the apk of the app you want to patch from apkmirror if you don\u0026rsquo;t have the suggested version of the app installed, select your patches and you\u0026rsquo;re done. If you have the suggested version just patch that and install it.\nHow revanced manager looks ","date":"October 19, 2023","img":"","lang":"en","langName":"English","largeImg":"","permalink":"/posts/revanced/","series":[],"smallImg":"","tags":[{"title":"Revanced","url":"/tags/revanced/"},{"title":"Android","url":"/tags/android/"}],"timestamp":1697705679,"title":"Revanced"},{"authors":[],"categories":[],"content":"Hi there, I\u0026rsquo;m Parsa.\n","date":"January 1, 1","img":"","lang":"en","langName":"English","largeImg":"","permalink":"/about/","series":[],"smallImg":"","tags":[],"timestamp":-62135596800,"title":"About"},{"authors":[],"categories":[],"content":"","date":"January 1, 1","img":"","lang":"en","langName":"English","largeImg":"","permalink":"/contact/","series":[],"smallImg":"","tags":[],"timestamp":-62135596800,"title":"Contact Us"},{"authors":[],"categories":[],"content":"","date":"January 1, 1","img":"","lang":"en","langName":"English","largeImg":"","permalink":"/offline/","series":[],"smallImg":"","tags":[],"timestamp":-62135596800,"title":"Offline"}]
